// src/app/article/articleInterface.ts

import empathy from "../../../public/articles/empathy.jpeg";
import technology from "../../../public/articles/technology.png";
import children from "../../../public/articles/children.jpeg";
import holistic from "../../../public/articles/holistic.webp";
import self from "../../../public/articles/self2.png";

export interface ArticlesResponse {
  data: Article[];
  meta: {
    pagination: {
      page: number;
      pageSize: number;
      pageCount: number;
      total: number;
    };
  };
}

export interface HardCodedArticle {
  id: number;
  title: string;
  publishedAt: string;
  preview: string;
  imageUrl: string;
  description: string[];
}

export const articles: HardCodedArticle[] = [
  {
    id: 1,
    title: "Ο ρόλος της ενσυναίσθησης στη σύγχρονη κοινωνία",
    publishedAt: "2025-03-05T15:57:08.890Z",
    preview:
      "Η ενσυναίσθηση αποτελεί ουσιαστική δεξιότητα στην εποχή της αποξένωσης, λειτουργώντας ως γέφυρα αλληλοκατανόησης και κοινωνικής συνοχής. Σε έναν κόσμο που κυριαρχείται από τον ατομικισμό, αναδεικνύεται ως βασικός μηχανισμός για τη δημιουργία ουσιαστικών σχέσεων.",
    imageUrl: `${empathy.src}`,
    description: [
      "Η ενσυναίσθηση, η ικανότητα να αντιλαμβανόμαστε και να κατανοούμε τα συναισθήματα και τις ανάγκες των άλλων, αποτελεί θεμέλιο της ανθρώπινης επικοινωνίας και συμβίωσης. Στη σημερινή κοινωνία, όπου οι γρήγοροι ρυθμοί ζωής, η τεχνολογία και η αποξένωση εντείνουν την ατομικότητα, η ανάγκη για ενσυναίσθηση είναι πιο επιτακτική από ποτέ.",
      "Η ενσυναίσθηση δεν είναι απλώς μια συναισθηματική αντίδραση· είναι μια συνειδητή στάση που προάγει την κατανόηση, τη συνεργασία και τη συνοχή στις ανθρώπινες σχέσεις. Μέσα από αυτή τη δεξιότητα, μπορούμε να γεφυρώσουμε τις διαφορές, να αντιμετωπίσουμε συγκρούσεις με σεβασμό και να συμβάλλουμε στη δημιουργία ενός πιο δίκαιου και ανεκτικού κοινωνικού περιβάλλοντος.",
      "Ιδιαίτερα σε πολυπολιτισμικές κοινωνίες ή σε περιόδους κρίσεων – όπως οικονομικές, υγειονομικές ή κοινωνικές – η ενσυναίσθηση είναι καθοριστική για την ενίσχυση της αλληλεγγύης και της κοινωνικής συνοχής. Μας βοηθά να βγούμε από το «εγώ» και να δούμε τον κόσμο μέσα από τα μάτια του άλλου, ενισχύοντας την αλληλοκατανόηση και τη συμπαράσταση.",
      "Επιπλέον, η ενσυναίσθηση είναι απαραίτητη και σε επαγγελματικά περιβάλλοντα, καθώς βελτιώνει τη συνεργασία και την επικοινωνία μεταξύ των ανθρώπων. Είναι μια δεξιότητα που καλλιεργείται με την προσοχή, την ακρόαση και τη διάθεση για κατανόηση.",
      "Σε μια κοινωνία που κινδυνεύει να απομακρυνθεί από την ανθρώπινη διάσταση, η ενσυναίσθηση λειτουργεί ως υπενθύμιση του κοινού μας δεσμού και της ανάγκης να ζούμε με περισσότερη ανθρωπιά.",
    ],
  },
  {
    id: 2,
    title: "Το αντίκτυπο της τεχνολογίας στις ζωές των ανθρώπων",
    publishedAt: "2025-02-05T15:57:08.890Z",
    preview:
      "Η τεχνολογία έχει βελτιώσει σημαντικά τη ζωή μας, αλλά παράλληλα έχει επιφέρει νέες προκλήσεις, όπως την αποξένωση και την κατάχρηση. Η σωστή και ισορροπημένη χρήση της είναι το κλειδί για μια πιο υγιή και ουσιαστική καθημερινότητα.",
    imageUrl: `${technology.src}`,
    description: [
      "Οι αλλαγές που έχει επιφέρει η τεχνολογία στη ζωή των ανθρώπων, επηρεάζει κάθε πτυχή της καθημερινότητάς μας – από την εργασία και την εκπαίδευση μέχρι την επικοινωνία και την ψυχαγωγία. Η θετική της επίδραση είναι αδιαμφισβήτητη: η άμεση πρόσβαση στην πληροφορία, η διευκόλυνση της εργασίας μέσω αυτοματισμών, η δυνατότητα για εξ αποστάσεως εκπαίδευση και εργασία, καθώς και η διατήρηση της επαφής με αγαπημένα πρόσωπα ανεξαρτήτως απόστασης, αποτελούν μόνο μερικά από τα οφέλη που έχει προσφέρει.",
      "Ωστόσο, η τεχνολογία έχει και αρνητικές πτυχές, που επηρεάζουν ιδιαίτερα την ψυχοκοινωνική ζωή των ανθρώπων. Η υπερβολική χρήση των συσκευών, η εξάρτηση από τα μέσα κοινωνικής δικτύωσης και η απομάκρυνση από τις διαπροσωπικές σχέσεις μπορούν να οδηγήσουν σε αποξένωση, άγχος, κατάθλιψη και μείωση της συγκέντρωσης. Επίσης, ζητήματα όπως η παραβίαση της ιδιωτικότητας, η παραπληροφόρηση και η τεχνολογική ανισότητα δημιουργούν νέες προκλήσεις για τις κοινωνίες.",
      "Η τεχνολογία, επομένως, είναι ένα εργαλείο με τεράστιες δυνατότητες, το οποίο μπορεί είτε να ενισχύσει την ποιότητα της ζωής είτε να την επιβαρύνει, ανάλογα με τη χρήση που της γίνεται. Η πρόκληση του σύγχρονου ανθρώπου είναι να διατηρήσει μια ισορροπία, αξιοποιώντας τις θετικές πτυχές της τεχνολογίας χωρίς να παραμελεί την ανθρώπινη επαφή, την ψυχική υγεία και την ουσιαστική σύνδεση με τον κόσμο γύρω του.",
    ],
  },
  {
    id: 3,
    title: "Η σημασία της κοινωνικοποίησης για τα παιδιά και τους εφήβους",
    publishedAt: "2025-02-06T15:57:08.890Z",
    preview:
      "Η κοινωνικοποίηση παίζει καθοριστικό ρόλο στην ψυχική, συναισθηματική και κοινωνική ανάπτυξη παιδιών και εφήβων, βοηθώντας τους να δημιουργούν σχέσεις και να διαμορφώνουν την ταυτότητά τους. Η ενεργή υποστήριξη από το περιβάλλον τους είναι ζωτικής σημασίας για τη σωστή εξέλιξή τους.",
    imageUrl: `${children.src}`,
    description: [
      "Η κοινωνικοποίηση αποτελεί έναν από τους βασικότερους παράγοντες για την ολόπλευρη ανάπτυξη των παιδιών και των εφήβων. Μέσα από την αλληλεπίδραση με συνομηλίκους, ενήλικες και κοινωνικά περιβάλλοντα, τα παιδιά μαθαίνουν να επικοινωνούν, να συνεργάζονται, να αναγνωρίζουν και να διαχειρίζονται τα συναισθήματά τους. Η κοινωνική μάθηση είναι καθοριστική για τη διαμόρφωση της ταυτότητας, της αυτοεκτίμησης και της ικανότητας δημιουργίας σχέσεων.",
      "Κατά την παιδική ηλικία, το παιχνίδι και η επαφή με άλλα παιδιά αποτελούν το κύριο μέσο κοινωνικοποίησης. Μέσω του παιχνιδιού, τα παιδιά μαθαίνουν τους κανόνες της κοινωνικής συμβίωσης, την έννοια της αμοιβαιότητας και της ενσυναίσθησης. Στην εφηβεία, η κοινωνικοποίηση παίρνει πιο σύνθετη μορφή, καθώς οι νέοι αρχίζουν να αναζητούν την αποδοχή της ομάδας, να διαμορφώνουν τις αξίες και τις πεποιθήσεις τους και να αναπτύσσουν πιο ουσιαστικές σχέσεις.",
      "Η απουσία κοινωνικών εμπειριών ή η απομόνωση μπορεί να επηρεάσει αρνητικά την ψυχοκοινωνική ανάπτυξη, προκαλώντας δυσκολίες στην επικοινωνία, αυξημένο άγχος ή αίσθημα μοναξιάς. Γι’ αυτό, είναι σημαντικό οι γονείς, οι εκπαιδευτικοί και η κοινωνία συνολικά να ενισχύουν ευκαιρίες για υγιή κοινωνική επαφή, προσφέροντας ένα ασφαλές και υποστηρικτικό περιβάλλον.",
      "Η κοινωνικοποίηση δεν είναι απλώς μια διαδικασία ανάπτυξης κοινωνικών δεξιοτήτων, αλλά το θεμέλιο για την ισορροπημένη ψυχική και συναισθηματική εξέλιξη των νέων.",
    ],
  },
  {
    id: 4,
    title: "Holistic – Integrative Coach Psychology",
    publishedAt: "2025-02-07T15:57:08.890Z",
    preview:
      "Η Ολιστική και Συνθετική Coaching Ψυχολογία συνδυάζει τεχνικές που ενισχύουν τη σωματική, συναισθηματική και πνευματική ευεξία, προάγοντας την ανάπτυξη του ατόμου σε διάφορους τομείς. Μέσα από μια ολοκληρωμένη προσέγγιση, βοηθά τα άτομα να επιτύχουν την ισορροπία και να πραγματοποιήσουν τους στόχους τους.",
    imageUrl: `${holistic.src}`,
    description: [
      "Η Ολιστική και Συνθετική Coaching Ψυχολογία αποτελεί μια σύγχρονη και καινοτόμο προσέγγιση που στοχεύει στην πλήρη ανάπτυξη του ανθρώπου, εστιάζοντας σε όλα τα επίπεδα της ύπαρξής του – το σωματικό, το συναισθηματικό, το νοητικό και το πνευματικό. Σε αντίθεση με πιο παραδοσιακά μοντέλα που επικεντρώνονται αποκλειστικά στη σκέψη ή στη συμπεριφορά, η ολιστική προσέγγιση βλέπει τον άνθρωπο ως ένα σύνολο, όπου κάθε διάσταση επηρεάζει και αλληλεπιδρά με τις υπόλοιπες.",
      "Η συνθετική διάσταση της μεθόδου αναφέρεται στην ενσωμάτωση ποικίλων τεχνικών και θεωρητικών προσεγγίσεων από την ψυχολογία, το coaching, τη σωματική ψυχοθεραπεία, τη διαλογιστική πρακτική και άλλες θεραπευτικές ή αναπτυξιακές σχολές. Αυτό επιτρέπει στον επαγγελματία να διαμορφώνει εξατομικευμένα πλάνα ανάπτυξης που ανταποκρίνονται στις ιδιαίτερες ανάγκες κάθε ατόμου.",
      "Βασικός στόχος της Ολιστικής και Συνθετικής Coaching Ψυχολογίας είναι να ενδυναμώσει το άτομο, ώστε να αναπτύξει αυτογνωσία, ανθεκτικότητα και σκοπό στη ζωή του. Μέσα από τη διαδικασία αυτή, το άτομο μαθαίνει να διαχειρίζεται αποτελεσματικά τις προκλήσεις, να εντοπίζει τους εσωτερικούς του πόρους και να επιτυγχάνει προσωπικούς και επαγγελματικούς στόχους με τρόπο αυθεντικό και ουσιαστικό.",
      "Σε μια εποχή έντονων αλλαγών και πιέσεων, αυτή η προσέγγιση προσφέρει ένα πολύτιμο εργαλείο για μια πιο ισορροπημένη, πλήρη και συνειδητή ζωή.",
    ],
  },
  {
    id: 5,
    title: "Η προσωποκεντρική προσέγγιση στη θεραπεία",
    publishedAt: "2025-02-08T15:57:08.890Z",
    preview:
      "Η προσωποκεντρική προσέγγιση του ανθρωπιστικού ψυχολόγου Carl Rogers δίνει έμφαση στην αυθεντική, αποδεκτική και ενσυναισθητική σχέση, ενθαρρύνοντας την εσωτερική ανάπτυξη και αυτοπραγμάτωση του ατόμου. Βασίζεται στην πίστη ότι κάθε άνθρωπος έχει μέσα του τη δύναμη για θετική αλλαγή, όταν βρίσκεται σε ένα περιβάλλον υποστήριξης.",
    imageUrl: `${self.src}`,
    description: [
      "Η προσωποκεντρική προσέγγιση του Carl Rogers αποτελεί έναν από τους σημαντικότερους άξονες της ανθρωπιστικής ψυχολογίας και έφερε μια ριζοσπαστική αλλαγή στον τρόπο που κατανοούμε τη θεραπευτική σχέση. Βασίζεται στην πεποίθηση ότι κάθε άτομο διαθέτει έμφυτη τάση προς την αυτοπραγμάτωση, δηλαδή τη συνεχή του ανάπτυξη και εξέλιξη, όταν βρίσκεται σε ένα περιβάλλον υποστήριξης και αποδοχής.",
      "Στο επίκεντρο της προσέγγισης βρίσκεται η αυθεντική και ισότιμη σχέση μεταξύ θεραπευτή και θεραπευόμενου. Ο θεραπευτής προσφέρει έναν ασφαλή χώρο, όπου κυριαρχούν τρεις βασικές συνθήκες: η άνευ όρων θετική αποδοχή, η ενσυναίσθηση και η αυθεντικότητα. Μέσα σε αυτό το πλαίσιο, το άτομο νιώθει ότι μπορεί να εκφράσει ελεύθερα τις σκέψεις και τα συναισθήματά του, χωρίς φόβο απόρριψης ή κριτικής.",
      "Η προσέγγιση του Rogers δεν αντιμετωπίζει το άτομο ως ένα σύνολο συμπτωμάτων, αλλά ως μια μοναδική προσωπικότητα που έχει τη δύναμη να βρει τις δικές της λύσεις. Εστιάζει στην προσωπική εμπειρία και στο «εδώ και τώρα», αναγνωρίζοντας τη σημασία της υποκειμενικότητας και της εσωτερικής αλήθειας κάθε ανθρώπου.",
      "Πρόκειται για μια θεραπευτική φιλοσοφία που εμπνέει εμπιστοσύνη, αυθεντικότητα και σεβασμό στην ανθρώπινη ύπαρξη.",
    ],
  },
];

export interface Article {
  id: number;
  attributes: {
    title: string;
    description: string;
    date: string;
    createdAt: string;
    updatedAt: string;
    publishedAt: string;
    preview: string;
    image?: {
      data?: {
        id: number;
        attributes: {
          name: string;
          alternativeText: string | null;
          caption: string | null;
          width: number;
          height: number;
          formats?: {
            thumbnail?: ImageFormat;
            small?: ImageFormat;
            medium?: ImageFormat;
            large?: ImageFormat;
          };
          hash: string;
          ext: string;
          mime: string;
          size: number;
          url: string; // URL for the original image
          previewUrl: string | null;
          provider: string;
          provider_metadata: any | null;
          createdAt: string;
          updatedAt: string;
        };
      };
    };
  };
}

export interface ImageFormat {
  name: string;
  hash: string;
  ext: string;
  mime: string;
  path: string | null;
  width: number;
  height: number;
  size: number;
  sizeInBytes: number;
  url: string; // URL for the specific format
}
