// src/app/article/articleInterface.ts

import empathy from "../../../public/articles/empathy.jpeg";
import technology from "../../../public/articles/technology.png";
import children from "../../../public/articles/children.jpeg";
import holistic from "../../../public/articles/holistic.webp";
import interpersonal from "../../../public/articles/interpersonal.jpg";
import solidarity from "../../../public/articles/solidarity.webp";

export interface ArticlesResponse {
  data: Article[];
  meta: {
    pagination: {
      page: number;
      pageSize: number;
      pageCount: number;
      total: number;
    };
  };
}

export interface HardCodedArticle {
  id: number;
  title: string;
  publishedAt: string;
  preview: string;
  imageUrl: string;
  description: string;
}

export const articles: HardCodedArticle[] = [
  {
    id: 1,
    title: "Ενσυναίσθηση στη σημερινή κοινωνία",
    publishedAt: "2025-03-05T15:57:08.890Z",
    preview:
      "Η ενσυναίσθηση είναι σήμερα πιο κρίσιμη από ποτέ, λειτουργώντας ως γέφυρα που συνδέει τους ανθρώπους σε μια εποχή όπου οι γρήγοροι ρυθμοί ζωής και η τεχνολογία ενισχύουν την απομόνωση. Καθώς οι κοινωνίες τείνουν προς τον ατομικισμό, η ικανότητα να κατανοούμε τα συναισθήματα και τις ανάγκες των άλλων αποκτά κεντρική σημασία. Η ενσυναίσθηση δεν αποτελεί απλά μια συναισθηματική αντίληψη, αλλά μια ενεργή διαδικασία που ενισχύει την αλληλοκατανόηση και την κοινωνική αλληλεγγύη, προάγοντας πιο υγιείς και σταθερές σχέσεις.",
    imageUrl: `${empathy.src}`,
    description:
      "Η ενσυναίσθηση είναι μια από τις πιο σημαντικές κοινωνικές δεξιότητες στη σύγχρονη εποχή. Όσο περισσότερο εξελίσσεται η τεχνολογία και αποξενώνονται οι άνθρωποι, τόσο μεγαλύτερη γίνεται η ανάγκη για ενσυναίσθηση, καθώς η ικανότητα να μπαίνουμε στη θέση των άλλων βοηθάει στην ενδυνάμωση των ανθρώπινων σχέσεων. Η ενσυναίσθηση δεν είναι μόνο το να νιώθουμε τα συναισθήματα του άλλου, αλλά να κατανοούμε και το πλαίσιο από το οποίο προέρχονται. Στις προσωπικές και επαγγελματικές σχέσεις, η ενσυναίσθηση προάγει την αλληλοκατανόηση και την αλληλοβοήθεια, αποτρέποντας συγκρούσεις και ενισχύοντας την κοινωνική συνοχή. Σε κοινωνίες που συχνά παλεύουν με την απομόνωση και τη μοναξιά, η ενσυναίσθηση μπορεί να αποτελέσει την κινητήρια δύναμη για τη δημιουργία ενός καλύτερου μέλλοντος, γεμάτο κατανόηση, αποδοχή και αλληλοϋποστήριξη.",
  },
  {
    id: 2,
    title: "Αντίκτυπο της τεχνολογίας στις ζωές των ανθρώπων (θετικά/αρνητικά)",
    publishedAt: "2025-02-05T15:57:08.890Z",
    preview:
      "Η τεχνολογία έχει επαναστατήσει τη ζωή μας, προσφέροντας θετικές εξελίξεις, όπως η άμεση επικοινωνία και η πρόσβαση σε πληροφορίες, αλλά ταυτόχρονα φέρνει και προκλήσεις που δεν μπορούν να αγνοηθούν. Εξετάζοντας τις επιπτώσεις της τεχνολογίας στην καθημερινότητά μας, είναι αναγκαίο να αναλογιστούμε πώς η εξάρτησή μας από αυτήν επηρεάζει τη φυσική και ψυχική μας ευημερία. Μέσα από την ανάλυση των θετικών και αρνητικών παραμέτρων, μπορούμε να βρούμε τρόπους να χρησιμοποιούμε την τεχνολογία με μεγαλύτερη συνειδητότητα.",
    imageUrl: `${technology.src}`,
    description:
      "Η τεχνολογία έχει επιφέρει τεράστιες αλλαγές στην καθημερινή ζωή των ανθρώπων, επηρεάζοντας τόσο την προσωπική όσο και την επαγγελματική τους ζωή. Από τη μία πλευρά, η τεχνολογία έχει φέρει απίστευτες ευκολίες: η άμεση επικοινωνία με ανθρώπους σε κάθε γωνιά του πλανήτη, η πρόσβαση σε πληθώρα πληροφοριών, η βελτίωση της υγειονομικής περίθαλψης και η αύξηση της παραγωγικότητας είναι μερικά από τα θετικά της τεχνολογικής προόδου. Από την άλλη, η υπερβολική εξάρτηση από την τεχνολογία μπορεί να οδηγήσει σε σοβαρά προβλήματα, όπως η αποξένωση, η κοινωνική απομόνωση, οι ψυχολογικές πιέσεις και η μείωση της ανθρώπινης επαφής. Οι άνθρωποι περνούν όλο και περισσότερο χρόνο μπροστά σε οθόνες, μειώνοντας την προσωπική αλληλεπίδραση και επιδεινώνοντας προβλήματα ψυχικής υγείας, όπως το άγχος και η κατάθλιψη. Ο αντίκτυπος της τεχνολογίας στις ζωές μας εξαρτάται από το πώς επιλέγουμε να την χρησιμοποιήσουμε και από την ισορροπία που κρατάμε μεταξύ του φυσικού και του ψηφιακού κόσμου.",
  },
  {
    id: 3,
    title:
      "Γιατί η κοινωνικοποίηση είναι σημαντική για τους ανθρώπους και ειδικά για τα παιδιά",
    publishedAt: "2025-02-06T15:57:08.890Z",
    preview:
      "Η κοινωνικοποίηση είναι θεμελιώδης για την ανάπτυξη των ανθρώπων, προσφέροντας κρίσιμες κοινωνικές και συναισθηματικές δεξιότητες. Ειδικά για τα παιδιά, η κοινωνική αλληλεπίδραση είναι η βάση για την καλλιέργεια της αυτοεκτίμησης και της συναισθηματικής ασφάλειας. Με τις σύγχρονες προκλήσεις που φέρνει η ψηφιακή εποχή, η ανάγκη για προσωπικές αλληλεπιδράσεις και κοινές εμπειρίες είναι πιο επιτακτική από ποτέ. Αυτό το άρθρο αναλύει τις επιπτώσεις της κοινωνικοποίησης στην ανάπτυξη και ευημερία των παιδιών.",
    imageUrl: `${children.src}`,
    description:
      "Η κοινωνικοποίηση είναι θεμελιώδης διαδικασία για την ανάπτυξη και την ευημερία των ανθρώπων, ιδιαίτερα των παιδιών. Μέσα από την κοινωνική αλληλεπίδραση, τα παιδιά μαθαίνουν σημαντικές δεξιότητες, όπως η επικοινωνία, η συνεργασία, η επίλυση συγκρούσεων και η κατανόηση των συναισθημάτων των άλλων. Αυτές οι δεξιότητες είναι απαραίτητες για την υγιή ανάπτυξη της προσωπικότητας και την οικοδόμηση αυτοπεποίθησης. Όταν τα παιδιά κοινωνικοποιούνται, αναπτύσσουν επίσης την αίσθηση του ανήκειν και της αποδοχής, που συμβάλλουν στη συναισθηματική τους ασφάλεια. Η κοινωνικοποίηση βοηθά τα παιδιά να κατανοήσουν τις κοινωνικές νόρμες και αξίες, αλλά και να διαμορφώσουν το αίσθημα του δικαίου και της ηθικής. Ειδικά στην ψηφιακή εποχή, η κοινωνικοποίηση εκτός οθόνης, μέσω προσωπικών επαφών και δραστηριοτήτων, είναι απαραίτητη για την ολόπλευρη ανάπτυξη και την ευτυχία των παιδιών.",
  },
  {
    id: 4,
    title: "Holistic – Integrative Coach Psychology",
    publishedAt: "2025-02-07T15:57:08.890Z",
    preview:
      "Η Ολιστική και Ενοποιημένη Ψυχολογία Coaching είναι μια καινοτόμος προσέγγιση που ενσωματώνει ποικίλες τεχνικές για την πλήρη ανάπτυξη του ατόμου. Εστιάζοντας στη σωματική, συναισθηματική και πνευματική ευεξία, η προσέγγιση αυτή προάγει μια ολιστική κατανόηση του ανθρώπου. Το άρθρο εξετάζει πώς οι διαφορετικές μέθοδοι και πρακτικές της ολιστικής ψυχολογίας μπορούν να βοηθήσουν στην προσωπική εξέλιξη και την επίτευξη των στόχων, ενδυναμώνοντας τα άτομα να επιτύχουν μια ισορροπημένη ζωή.",
    imageUrl: `${holistic.src}`,
    description:
      "Η Ολιστική και Ενοποιητική Ψυχολογία Coaching αποτελεί έναν πρωτοποριακό τρόπο προσέγγισης της ανθρώπινης ανάπτυξης, εστιάζοντας στην ενσωμάτωση διαφόρων τεχνικών και πρακτικών για την ολόπλευρη εξέλιξη του ατόμου. Σε αυτήν την προσέγγιση, το άτομο αντιμετωπίζεται ως σύνολο — σωματικά, συναισθηματικά, νοητικά και πνευματικά. Η Holistic – Integrative Coach Psychology συνδυάζει την παραδοσιακή ψυχολογία με τεχνικές coaching, με στόχο να βοηθήσει το άτομο να αποκτήσει αυτογνωσία, να βελτιώσει τις δεξιότητες του και να επιτύχει προσωπικούς και επαγγελματικούς στόχους. Αυτό το μοντέλο συμβάλλει στη δημιουργία ισορροπημένων και αυθεντικών σχέσεων, καθώς διδάσκει στους ανθρώπους να διαχειρίζονται το άγχος, να αναπτύσσουν ανθεκτικότητα και να επιτυγχάνουν την εσωτερική γαλήνη. Η ολιστική προσέγγιση αναγνωρίζει ότι κάθε άνθρωπος είναι μοναδικός και γι' αυτό χρησιμοποιεί εξατομικευμένες στρατηγικές για την προώθηση της ευημερίας σε όλους τους τομείς της ζωής του.",
  },
  {
    id: 5,
    title:
      "Διαπροσωπικές σχέσεις ενηλίκων (αλλοτροίωση σχέσεων μεταξύ των ανθρώπων και πως ήταν παλιά)",
    publishedAt: "2025-02-08T15:57:08.890Z",
    preview:
      "Στις διαπροσωπικές σχέσεις ενηλίκων, η αλλοτρίωση και η απομάκρυνση είναι φαινόμενα που έχουν ενταθεί με την πάροδο του χρόνου. Το άρθρο διερευνά τις αλλαγές που έχουν συμβεί στις ανθρώπινες σχέσεις, αναλύοντας τις παραδοσιακές μορφές αλληλεπίδρασης σε σύγκριση με τη σύγχρονη εποχή. Εξετάζει τους παράγοντες που συμβάλλουν στην απομάκρυνση και προτείνει στρατηγικές για την ενίσχυση των διαπροσωπικών σχέσεων στην ψηφιακή εποχή.",
    imageUrl: `${interpersonal.src}`,
    description:
      "Οι διαπροσωπικές σχέσεις ενηλίκων αποτελούν ένα περίπλοκο πεδίο αλληλεπίδρασης που έχει υποστεί σημαντικές αλλαγές με την πάροδο των ετών. Παλιότερα, οι ανθρώπινες σχέσεις χαρακτηρίζονταν από άμεσες αλληλεπιδράσεις, κοινοτικές δραστηριότητες και στενές σχέσεις, οι οποίες ενισχύονταν από την καθημερινή επαφή. Σήμερα, ωστόσο, η αλλοτρίωση και η απομάκρυνση μεταξύ των ανθρώπων είναι πιο συχνές. Αυτή η απομάκρυνση προκύπτει από παράγοντες όπως η ψηφιακή επικοινωνία, η έλλειψη χρόνου και η πίεση της καθημερινότητας. Οι άνθρωποι συχνά επικοινωνούν μέσω οθονών, χάνοντας την προσωπική επαφή και την ουσιαστική αλληλεπίδραση. Αυτό το άρθρο αναλύει τις αιτίες αυτής της αλλοτρίωσης και προτείνει τρόπους για την αποκατάσταση των διαπροσωπικών σχέσεων, εστιάζοντας στην αξία της προσωπικής επαφής, της αλληλεγγύης και της ενσυναίσθησης για την επανασύνδεση των ανθρώπων στην εποχή του ψηφιακού κόσμου.",
  },
  {
    id: 6,
    title: "Η σημασία της ενσυναίσθησης για τους επαγγελματίες ψυχικής υγείας",
    publishedAt: "2025-02-08T15:57:08.890Z",
    preview:
      "Η ενσυναίσθηση είναι θεμελιώδης δεξιότητα για τους επαγγελματίες ψυχικής υγείας, καθώς επιτρέπει την κατανόηση και υποστήριξη των ασθενών τους. Μέσω της ενσυναίσθησης, οι θεραπευτές δημιουργούν μια ασφαλή και υποστηρικτική σχέση, ενθαρρύνοντας τη θεραπεία και την αυτογνωσία. Αυτό το άρθρο αναλύει τη σημασία της ενσυναίσθησης στην ψυχική υγεία και προσφέρει προτάσεις για την ανάπτυξή της στο επαγγελματικό περιβάλλον.",
    imageUrl: `${solidarity.src}`,
    description:
      "Η ενσυναίσθηση είναι μια από τις πιο σημαντικές δεξιότητες για τους επαγγελματίες ψυχικής υγείας, καθώς τους επιτρέπει να κατανοούν και να υποστηρίζουν τους ασθενείς τους σε βάθος. Η ικανότητα να μπαίνουν στη θέση των άλλων και να κατανοούν τα συναισθήματά τους είναι κρίσιμη για τη δημιουργία μιας ασφαλούς και υποστηρικτικής θεραπευτικής σχέσης. Οι θεραπευτές που διαθέτουν ενσυναίσθηση είναι σε θέση να παρέχουν μια ατμόσφαιρα αποδοχής, όπου οι ασθενείς μπορούν να εξερευνήσουν τα συναισθήματά τους και να δουλέψουν για την αυτογνωσία και την ψυχική τους ευημερία. Η ανάπτυξη της ενσυναίσθησης περιλαμβάνει την ενεργή ακρόαση, τη μη επικριτική στάση και την ικανότητα να αναγνωρίζουν και να αποδέχονται τα συναισθήματα των άλλων. Το άρθρο προσφέρει πρακτικές στρατηγικές για τη βελτίωση της ενσυναίσθησης στον επαγγελματικό τομέα και υπογραμμίζει τη σημασία της ως εργαλείο για την αποτελεσματική θεραπεία και υποστήριξη των ασθενών.",
  },
];

export interface Article {
  id: number;
  attributes: {
    title: string;
    description: string;
    date: string;
    createdAt: string;
    updatedAt: string;
    publishedAt: string;
    preview: string;
    image?: {
      data?: {
        id: number;
        attributes: {
          name: string;
          alternativeText: string | null;
          caption: string | null;
          width: number;
          height: number;
          formats?: {
            thumbnail?: ImageFormat;
            small?: ImageFormat;
            medium?: ImageFormat;
            large?: ImageFormat;
          };
          hash: string;
          ext: string;
          mime: string;
          size: number;
          url: string; // URL for the original image
          previewUrl: string | null;
          provider: string;
          provider_metadata: any | null;
          createdAt: string;
          updatedAt: string;
        };
      };
    };
  };
}

export interface ImageFormat {
  name: string;
  hash: string;
  ext: string;
  mime: string;
  path: string | null;
  width: number;
  height: number;
  size: number;
  sizeInBytes: number;
  url: string; // URL for the specific format
}
