const holisticData = [
  {
    title: 'ΤΙ ΕΙΝΑΙ ΤΟ HOLISTIC - INTEGRATIVE COACHING',
    description:
      'Το Holistic – Integrative Coaching συνδυάζει παραδοσιακές και εναλλακτικές τεχνικές με στόχο την ολιστική ανάπτυξη και βελτίωση του ατόμου. Εστιάζει στην ισορροπία μεταξύ σώματος, νου και πνεύματος, προσφέροντας μια συνολική προσέγγιση για την αντιμετώπιση των προκλήσεων και την επίτευξη προσωπικών στόχων.',
    color: '#D4A5A5',
  },
  {
    title: 'ΣΕ ΠΟΙΟΥΣ ΑΠΕΥΘΥΝΕΤΑΙ',
    description:
      'Το "Holistic - Integrative Coaching" απευθύνεται σε υγιή/μη κλινικό πληθυσμό που επιθυμεί να βελτιώσει τη συνολική ποιότητα της ζωής του μέσω μιας ολιστικής και ολοκληρωμένης προσέγγισης. Συγκεκριμένα, είναι κατάλληλο για όσους αναζητούν ισορροπία μεταξύ του νου, του σώματος και της ψυχής, καθώς και για όσους θέλουν να ενισχύσουν την προσωπική τους ανάπτυξη, να βρουν νόημα και σκοπό στη ζωή τους και να επιτύχουν μεγαλύτερη ευεξία. Επίσης, απευθύνεται σε ανθρώπους που αντιμετωπίζουν επαγγελματικές προκλήσεις ή αλλαγές στη ζωή τους και χρειάζονται υποστήριξη για να επιτύχουν τους στόχους τους μέσω μιας ολιστικής προσέγγισης.',
    color: '#A9D6E5',
  },
  {
    title: 'Η ΠΡΟΣΕΓΓΙΣΗ ΜΟΥ ',
    description:
      'Είναι βασισμένη στην προσωποκεντρική προσέγγιση του ανθρωπιστικού ψυχολόγου Carl Rogers. Θα σε βοηθήσω να ανακαλύψεις τις πραγματικές σου δυνάμεις και ικανότητες και να ζήσεις μια όμορφη ζωή.',
    color: '#A8C3A7',
  },
  {
    title: 'ΣΥΝΕΔΡΙΕΣ',
    description:
      'Οι συνεδρίες διαρκούν 50 λεπτά (στην υπνοθεραπεία, 1 ώρα) και πραγματοποιούνται είτε δια ζώσης είτε online. Μπορούν επίσης να πραγματοποιηθούν και σε ήσυχο εξωτερικό χώρο (π.χ. παραλία, πάρκο κ.ά.). Οι συνεδρίες είναι είτε εβδομαδιαίες ή κάθε 2 εβδομάδες. Το coaching είναι μια βραχυπρόθεσμη διαδικασία συναντήσεων. Μόλις επιτευχθεί ο στόχος μας οι συναντήσεις μας σταματάνε, εκτός εάν θέλουμε να επιτύχουμε έναν καινούργιο στόχο.',
    color: '#C4B7CB',
  },
];

export default holisticData;
