const holisticData = [
  {
    title: 'ΣΕ ΠΟΙΟΥΣ ΑΠΕΥΘΥΝΕΤΑΙ',
    description:
      'Σε υγιή/μη κλινικό πληθυσμό, ο οποίος θέλει να επιτύχει κάποιο στόχο. Αυτό μπορεί να περιλαμβάνει μείωση στρες, απώλεια βάρους, διακοπή καπνίσματος, αλλαγή καριέρας, αυτοβελτίωση κτλ.)',
    color: '#A9D6E5',
  },
  {
    title: 'ΓΙΑΤΙ ΝΑ ΕΠΙΛΕΞΕΙΣ ΤΟ HOLISTIC - INTEGRATIVE COACHING',
    description:
      'Το Holistic – Integrative Coaching συνδυάζει παραδοσιακές και εναλλακτικές τεχνικές με στόχο την ολιστική ανάπτυξη και βελτίωση του ατόμου. Εστιάζει στην ισορροπία μεταξύ σώματος, νου και πνεύματος, προσφέροντας μια συνολική προσέγγιση για την αντιμετώπιση των προκλήσεων και την επίτευξη προσωπικών στόχων.',
    color: '#D4A5A5',
  },
  {
    title: 'ΠΟΙΑ ΕΙΝΑΙ Η ΠΡΟΣΕΓΓΙΣΗ ΜΟΥ ΓΙΑΤΙ ΝΑ ΜΕ ΕΠΙΛΕΞΕΙΣ',
    description:
      'Είναι βασισμένη στην προσωποκεντρική προσέγγιση του Carl Rogers και ένας συνδυασμός άλλων πραγμάτων. Θα σε βοηθήσω να ανακαλύψεις τις πραγματικές σου δυνάμεις και ικανότητες και να ζήσεις μια όμορφη ζωή.',
    color: '#A8C3A7',
  },
  {
    title: 'ΣΥΝΕΔΡΕΙΕΣ',
    description:
      'Οι συνεδρίες διαρκούν 50 λεπτά (στην υπνοθεραπεία, 1 ώρα) και πραγματοποιούνται είτε δια ζώσης είτε online. Μπορούν επίσης να πραγματοποιηθούν και σε ήσυχο εξωτερικό χώρο (π.χ. παραλία, πάρκο κ.ά.). Οι συνεδρίες είναι είτε εβδομαδιαίες ή κάθε 2 εβδομάδες. Το coaching είναι μια βραχυπρόθεσμη διαδικασία συναντήσεων. Μόλις επιτευχθεί ο στόχος μας οι συναντήσεις μας σταματάνε, εκτός εάν θέλουμε να επιτύχουμε έναν καινούργιο στόχο.',
    color: '#C4B7CB',
  },
];

export default holisticData;
