import { StaticImageData } from 'next/image';
import artTherapy from '../../public/images/art-therapy.jpg';
import sleepTherapy from '../../public/images/sleep-therapy.jpg';
import transpersonalCoaching from '../../public/images/transpersonal-coaching.jpg';
import positivePsychology from '../../public/images/positive-psychology.jpg';
import cbt from '../../public/images/cbt.jpg';
import mindfulness from '../../public/images/mindfulness.jpg';
import guidedImagery from '../../public/images/guided-imagery.jpg';

export interface TherapyToolAnalysis {
  id: number;
  nameId: string;
  imageUrl: StaticImageData;
  generalTitle: string;
  mainTitle: string;
  startingParagraph?: string;
  linkTitle: string;
  sections: {
    title: string;
    paragraph: string;
  }[];
}

const therapyToolsAnalysis: TherapyToolAnalysis[] = [
  {
    id: 1,
    imageUrl: artTherapy,
    generalTitle: 'Γενικές Πληροφορίες για την Τέχνη',
    nameId: 'art-therapy',
    mainTitle: 'ART THERAPY / ΘΕΡΑΠΕΙΑ ΜΕΣΩ ΤΕΧΝΗΣ',
    startingParagraph:
      'Μέθοδος θεραπείας που χρησιμοποιεί την τέχνη ως μέσο για την επίτευξη εσωτερικής αλλαγής και αυτογνωσίας.',
    linkTitle: 'Art-therapy',
    sections: [
      {
        title: 'Τι είναι η Θεραπεία Μέσω Τέχνης;',
        paragraph:
          'Η θεραπεία μέσω τέχνης είναι μια μορφή θεραπείας που αξιοποιεί τη δημιουργική διαδικασία της καλλιτεχνικής έκφρασης για τη βελτίωση της ψυχικής, συναισθηματικής και σωματικής ευεξίας ενός ατόμου. Συνδυάζει παραδοσιακές ψυχοθεραπευτικές τεχνικές με τη δημιουργική διαδικασία για να βοηθήσει τους πελάτες να εξερευνήσουν τα συναισθήματά τους, να συμβιβάσουν συναισθηματικές συγκρούσεις, να ενισχύσουν την αυτογνωσία και να διαχειριστούν τη συμπεριφορά και τις εξαρτήσεις',
      },
      {
        title: 'Οφέλη της Θεραπείας Μέσω Τέχνης',
        paragraph:
          'Η θεραπεία μέσω τέχνης μπορεί να είναι ευεργετική για άτομα όλων των ηλικιών και κοινωνικών προελεύσεων, και δεν απαιτείται καμία καλλιτεχνική δεξιότητα ή ταλέντο για να συμμετάσχει κανείς. Μπορεί να χρησιμοποιηθεί για την αντιμετώπιση μιας ευρείας γκάμας ζητημάτων, όπως το άγχος, η κατάθλιψη, το τραύμα, το πένθος και τα προβλήματα σχέσεων.',
      },
    ],
  },
  {
    id: 2,
    nameId: 'hypnotherapy',
    imageUrl: sleepTherapy,
    generalTitle: 'Γενικές Πληροφορίες για την Υπνοθεραπεία',
    mainTitle: 'ΥΠΝΟΘΕΡΑΠΕΙΑ',
    linkTitle: 'Υπνοθεραπεία',
    startingParagraph:
      'Θεραπευτική τεχνική που χρησιμοποιεί τον ύπνο για την αντιμετώπιση και την ανάλυση ψυχολογικών προβλημάτων.',
    sections: [
      {
        title: 'Τι είναι η Υπνοθεραπεία;',
        paragraph:
          'Η Υπνοθεραπεία συνδυάζει τη χαλάρωση με καθοδηγούμενες προτάσεις για να βοηθήσει τα άτομα να επιτύχουν βαθιά αλλαγή στη σκέψη και τη συμπεριφορά.',
      },
      {
        title: 'Οφέλη της Υπνοθεραπείας',
        paragraph:
          'Μπορεί να βοηθήσει στη διαχείριση του άγχους, την επίλυση προβλημάτων ύπνου, και την ανακούφιση από χρόνιο πόνο.',
      },
    ],
  },
  {
    id: 3,
    nameId: 'transpersonal-coaching',
    imageUrl: transpersonalCoaching,
    generalTitle: 'Γενικές Πληροφορίες για το Υπερπροσωπικό Coaching',
    mainTitle: 'TRANSPERSONAL COACHING/ΥΠΕΡΠΡΟΣΩΠΙΚΟ COACHING',
    linkTitle: 'Transpersonal coaching',
    startingParagraph:
      'Σύγχρονη μέθοδος coaching που επικεντρώνεται στην ανάπτυξη της προσωπικής αυτογνωσίας και της διανόησης.',
    sections: [
      {
        title: 'Τι είναι το Υπερπροσωπικό Coaching;',
        paragraph:
          'Συνδυάζει παραδοσιακές τεχνικές coaching με πνευματικές πρακτικές για να βοηθήσει τα άτομα να επιτύχουν πλήρη αυτογνωσία και προσωπική ανάπτυξη.',
      },
      {
        title: 'Οφέλη του Υπερπροσωπικού Coaching',
        paragraph:
          'Ενισχύει την αυτογνωσία, την πνευματική ανάπτυξη, και την επίτευξη προσωπικών και επαγγελματικών στόχων.',
      },
    ],
  },
  {
    id: 4,
    nameId: 'positive-psychology',
    imageUrl: positivePsychology,
    generalTitle: 'Γενικές Πληροφορίες για τη Θετική Ψυχολογία',
    mainTitle: 'ΘΕΤΙΚΗ ΨΥΧΟΛΟΓΙΑ',
    linkTitle: 'Θετική ψυχολογία',
    startingParagraph:
      'Ψυχολογική προσέγγιση που επικεντρώνεται στην ανάπτυξη των θετικών ψυχικών διαδικασιών και της ευημερίας.',
    sections: [
      {
        title: 'Τι είναι η Θετική Ψυχολογία;',
        paragraph:
          'Είναι μια προσέγγιση που επικεντρώνεται στην ενίσχυση των θετικών συναισθημάτων, των σχέσεων, και των επιτευγμάτων για τη βελτίωση της συνολικής ευημερίας.',
      },
      {
        title: 'Οφέλη της Θετικής Ψυχολογίας',
        paragraph:
          'Βοηθά τα άτομα να αναπτύξουν ανθεκτικότητα, θετική σκέψη, και να βελτιώσουν τις σχέσεις τους με άλλους.',
      },
    ],
  },
  {
    id: 5,
    nameId: 'relaxation-techniques-cbt',
    imageUrl: cbt,
    generalTitle: 'Γενικές Πληροφορίες για τις Τεχνικές Χαλάρωσης και CBT',
    mainTitle: 'ΤΕΧΝΙΚΕΣ ΧΑΛΑΡΩΣΗΣ + CBT',
    linkTitle: 'Τεχνικές χαλάρωσης',
    startingParagraph:
      'Συνδυασμός τεχνικών αποκατάστασης και Συμπεριφορικής Θεραπείας για την αντιμετώπιση της άγχους και των καταστάσεων άγχους.',
    sections: [
      {
        title: 'Τι είναι οι Τεχνικές Χαλάρωσης και CBT;',
        paragraph:
          'Συνδυάζουν ασκήσεις χαλάρωσης με τεχνικές Γνωσιακής Συμπεριφορικής Θεραπείας για να βοηθήσουν τα άτομα να διαχειριστούν το άγχος και να αλλάξουν αρνητικά πρότυπα σκέψης.',
      },
      {
        title: 'Οφέλη των Τεχνικών Χαλάρωσης και CBT',
        paragraph:
          'Μειώνουν το άγχος, βελτιώνουν την ψυχική υγεία, και προάγουν την ευημερία.',
      },
    ],
  },
  {
    id: 6,
    nameId: 'mindfulness',
    imageUrl: mindfulness,
    generalTitle: 'Γενικές Πληροφορίες για τον Διαλογισμό Mindfulness',
    mainTitle: 'MINDFULNESS ΔΙΑΛΟΓΙΣΜΟΣ',
    linkTitle: 'Mindfulness διαλογισμός',
    startingParagraph:
      'Ψυχολογική τεχνική που επικεντρώνεται στην ανάπτυξη της προσεκτικότητας και της επίγνωσης στην καθημερινότητα.',
    sections: [
      {
        title: 'Τι είναι ο Διαλογισμός Mindfulness;',
        paragraph:
          'Είναι μια πρακτική που βοηθά τα άτομα να εστιάζουν στην παρούσα στιγμή με αποδοχή και χωρίς κριτική, για να βελτιώσουν την ψυχική τους υγεία και ευημερία.',
      },
      {
        title: 'Οφέλη του Διαλογισμού Mindfulness',
        paragraph:
          'Βοηθά στη μείωση του άγχους, βελτιώνει την αυτοσυγκέντρωση, και προάγει την ψυχική ηρεμία.',
      },
    ],
  },
  {
    id: 7,
    nameId: 'guided-imagery',
    imageUrl: guidedImagery,
    generalTitle:
      'Γενικές Πληροφορίες για τις Καθοδηγούμενες Εικόνες και Οραματισμούς',
    mainTitle: 'ΚΑΘΟΔΗΓΟΥΜΕΝΕΣ ΕΙΚΟΝΕΣ ΚΑΙ ΟΡΑΜΑΤΙΣΜΟΙ',
    linkTitle: 'Καθοδηγούμενες εικόνες',
    startingParagraph:
      'Ψυχολογική μέθοδος που χρησιμοποιεί την οπτική φαντασία για την αυτογνωσία και την ενίσχυση της θεραπευτικής διαδικασίας.',
    sections: [
      {
        title: 'Τι είναι οι Καθοδηγούμενες Εικόνες και Οραματισμοί;',
        paragraph:
          'Είναι μια τεχνική που βοηθά τα άτομα να χρησιμοποιήσουν τη φαντασία τους για να επιτύχουν χαλάρωση, αυτογνωσία, και θεραπευτική πρόοδο.',
      },
      {
        title: 'Οφέλη των Καθοδηγούμενων Εικόνων και Οραματισμών',
        paragraph:
          'Ενισχύουν τη χαλάρωση, προάγουν την ψυχική υγεία, και βοηθούν στην επεξεργασία συναισθημάτων και εμπειριών.',
      },
    ],
  },
];

export default therapyToolsAnalysis;
