import { StaticImageData } from 'next/image';
import artTherapy from '../../public/images/art-therapy.jpg';
import sleepTherapy from '../../public/images/sleep-therapy.jpg';
import transpersonalCoaching from '../../public/images/transpersonal-coaching.jpg';
import positivePsychology from '../../public/images/positive-psychology.jpg';
import cbt from '../../public/images/cbt.jpg';
import mindfulness from '../../public/images/mindfulness.jpg';
import guidedImagery from '../../public/images/guided-imagery.jpg';

export interface TherapyToolAnalysis {
  id: number;
  nameId: string;
  imageUrl: StaticImageData;
  generalTitle: string;
  mainTitle: string;
  startingParagraph?: string;
  linkTitle: string;
  sections: {
    title: string;
    paragraph: string;
  }[];
}

const therapyToolsAnalysis: TherapyToolAnalysis[] = [
  {
    id: 1,
    imageUrl: artTherapy,
    generalTitle: 'Γενικές Πληροφορίες για την Τέχνη',
    nameId: 'art-therapy',
    mainTitle: 'ART THERAPY / ΘΕΡΑΠΕΙΑ ΜΕΣΩ ΤΕΧΝΗΣ',
    startingParagraph:
      'Μέθοδος θεραπείας που χρησιμοποιεί την τέχνη ως μέσο για την επίτευξη εσωτερικής αλλαγής και αυτογνωσίας.',
    linkTitle: 'Art-therapy',
    sections: [
      {
        title: 'Τι είναι η Θεραπεία Μέσω Τέχνης;',
        paragraph:
          'Η θεραπεία μέσω τέχνης είναι μια μορφή θεραπείας που αξιοποιεί τη δημιουργική διαδικασία της καλλιτεχνικής έκφρασης για τη βελτίωση της ψυχικής, συναισθηματικής και σωματικής ευεξίας ενός ατόμου. Συνδυάζει παραδοσιακές ψυχοθεραπευτικές τεχνικές με τη δημιουργική διαδικασία για να βοηθήσει τους πελάτες να εξερευνήσουν τα συναισθήματά τους, να συμβιβάσουν συναισθηματικές συγκρούσεις, να ενισχύσουν την αυτογνωσία και να διαχειριστούν τη συμπεριφορά και τις εξαρτήσεις.',
      },
      {
        title: 'Οφέλη της Θεραπείας Μέσω Τέχνης',
        paragraph:
          'Η θεραπεία μέσω τέχνης μπορεί να είναι ευεργετική για άτομα όλων των ηλικιών και κοινωνικών προελεύσεων, και δεν απαιτείται καμία καλλιτεχνική δεξιότητα ή ταλέντο για να συμμετάσχει κανείς. Μπορεί να χρησιμοποιηθεί για την αντιμετώπιση μιας ευρείας γκάμας ζητημάτων, όπως το άγχος, η κατάθλιψη, το τραύμα, το πένθος και τα προβλήματα σχέσεων.',
      },
    ],
  },
  {
    id: 2,
    nameId: 'hypnotherapy',
    imageUrl: sleepTherapy,
    generalTitle: 'Γενικές Πληροφορίες για την Υπνοθεραπεία',
    mainTitle: 'ΥΠΝΟΘΕΡΑΠΕΙΑ',
    linkTitle: 'Υπνοθεραπεία',
    startingParagraph:
      'Θεραπευτική τεχνική που χρησιμοποιεί τον ύπνο για την αντιμετώπιση και την ανάλυση ψυχολογικών προβλημάτων.',
    sections: [
      {
        title: 'Τι είναι η Υπνοθεραπεία;',
        paragraph:
          'Η Υπνοθεραπεία είναι μια ψυχοθεραπευτική τεχνική που χρησιμοποιεί τη χαλάρωση και τις καθοδηγούμενες προτάσεις για να επιφέρει αλλαγές στις σκέψεις και τη συμπεριφορά ενός ατόμου. Μέσω της ύπνωσης, ο θεραπευτής καθοδηγεί τον πελάτη σε μια κατάσταση βαθιάς χαλάρωσης και συγκέντρωσης, επιτρέποντας την πρόσβαση στο υποσυνείδητο. Αυτή η διαδικασία μπορεί να αποκαλύψει υποκείμενα συναισθηματικά ζητήματα και να βοηθήσει στην επίλυση προβλημάτων ή τραυμάτων που δεν είναι εύκολα προσεγγίσιμα με άλλες θεραπευτικές μεθόδους.',
      },
      {
        title: 'Οφέλη της Υπνοθεραπείας',
        paragraph:
          'Η Υπνοθεραπεία μπορεί να προσφέρει πολλαπλά οφέλη για την ψυχική και σωματική ευεξία. Βοηθά στην αποτελεσματική διαχείριση του άγχους, της ανησυχίας και της αϋπνίας, προσφέροντας μια μέθοδο για τη χαλάρωση και την ανακούφιση από ψυχικές εντάσεις. Επίσης, μπορεί να χρησιμοποιηθεί για την ανακούφιση από χρόνιο πόνο, τη βελτίωση της αυτοεκτίμησης και την αντιμετώπιση εθιστικών συμπεριφορών, προάγοντας τη συνολική ψυχολογική ευημερία.',
      },
    ],
  },
  {
    id: 3,
    nameId: 'transpersonal-coaching',
    imageUrl: transpersonalCoaching,
    generalTitle: 'Γενικές Πληροφορίες για το Υπερπροσωπικό Coaching',
    mainTitle: 'TRANSPERSONAL COACHING/ΥΠΕΡΠΡΟΣΩΠΙΚΟ COACHING',
    linkTitle: 'Transpersonal coaching',
    startingParagraph:
      'Σύγχρονη μέθοδος coaching που επικεντρώνεται στην ανάπτυξη της προσωπικής αυτογνωσίας και της διανόησης.',
    sections: [
      {
        title: 'Τι είναι το Υπερπροσωπικό Coaching;',
        paragraph:
          'Το Υπερπροσωπικό Coaching συνδυάζει τις παραδοσιακές τεχνικές coaching με πνευματικές και φιλοσοφικές προσεγγίσεις για να ενισχύσει την προσωπική ανάπτυξη και την αυτογνωσία. Αυτή η μέθοδος ενθαρρύνει τα άτομα να εξερευνήσουν βαθύτερες πτυχές της προσωπικότητάς τους και να αναγνωρίσουν τις πνευματικές τους αξίες και στόχους. Μέσω της διαδικασίας του coaching, οι πελάτες μαθαίνουν να συνδυάζουν τις προσωπικές τους επιδιώξεις με μια μεγαλύτερη αίσθηση σκοπού και νόημα στη ζωή τους.',
      },
      {
        title: 'Οφέλη του Υπερπροσωπικού Coaching',
        paragraph:
          'Το Υπερπροσωπικό Coaching μπορεί να προσφέρει μια ποικιλία οφελών, όπως η ενίσχυση της αυτογνωσίας, η πνευματική ανάπτυξη και η επίτευξη προσωπικών και επαγγελματικών στόχων. Βοηθά τους ανθρώπους να αποκτήσουν μια σαφέστερη κατανόηση των εσωτερικών τους κινήτρων και να προχωρήσουν σε αλλαγές που ανταγωνίζονται την προσωπική τους ευημερία. Επίσης, ενισχύει τη συνειδητότητα και βοηθά τους πελάτες να ζήσουν μια πιο ισορροπημένη και ολοκληρωμένη ζωή.',
      },
    ],
  },
  {
    id: 4,
    nameId: 'positive-psychology',
    imageUrl: positivePsychology,
    generalTitle: 'Γενικές Πληροφορίες για τη Θετική Ψυχολογία',
    mainTitle: 'ΘΕΤΙΚΗ ΨΥΧΟΛΟΓΙΑ',
    linkTitle: 'Θετική ψυχολογία',
    startingParagraph:
      'Ψυχολογική προσέγγιση που επικεντρώνεται στην ανάπτυξη των θετικών ψυχικών διαδικασιών και της ευημερίας.',
    sections: [
      {
        title: 'Τι είναι η Θετική Ψυχολογία;',
        paragraph:
          'Η Θετική Ψυχολογία είναι ένας τομέας της ψυχολογίας που επικεντρώνεται στην ενίσχυση των θετικών συναισθημάτων, της ευημερίας και των επιτευγμάτων. Σε αντίθεση με άλλες ψυχολογικές προσεγγίσεις που επικεντρώνονται κυρίως στη θεραπεία ψυχικών διαταραχών, η Θετική Ψυχολογία εξετάζει τρόπους για την ενίσχυση της θετικής εμπειρίας και της προσωπικής ανάπτυξης. Στοχεύει στην καλλιέργεια της ευτυχίας, της ελπίδας, και της ευγνωμοσύνης, προάγοντας την συνολική ποιότητα ζωής.',
      },
      {
        title: 'Οφέλη της Θετικής Ψυχολογίας',
        paragraph:
          'Η Θετική Ψυχολογία συμβάλλει στη βελτίωση της ψυχικής ευημερίας και της ανθεκτικότητας των ατόμων. Μέσω της ανάπτυξης θετικών σκέψεων και συναισθημάτων, προάγει την ικανότητα των ανθρώπων να αντιμετωπίζουν προκλήσεις και να επιτυγχάνουν προσωπικούς στόχους. Ενισχύει τη συναισθηματική ανθεκτικότητα, βελτιώνει τις διαπροσωπικές σχέσεις και συμβάλλει στην αίσθηση της ευημερίας και της πληρότητας στη ζωή.',
      },
    ],
  },
  {
    id: 5,
    nameId: 'relaxation-techniques-cbt',
    imageUrl: cbt,
    generalTitle: 'Γενικές Πληροφορίες για τις Τεχνικές Χαλάρωσης και CBT',
    mainTitle: 'ΤΕΧΝΙΚΕΣ ΧΑΛΑΡΩΣΗΣ + CBT',
    linkTitle: 'Τεχνικές χαλάρωσης',
    startingParagraph:
      'Συνδυασμός τεχνικών αποκατάστασης και Συμπεριφορικής Θεραπείας για την αντιμετώπιση της άγχους και των καταστάσεων άγχους.',
    sections: [
      {
        title: 'Τι είναι οι Τεχνικές Χαλάρωσης και CBT;',
        paragraph:
          'Οι Τεχνικές Χαλάρωσης και η Γνωσιακή Συμπεριφορική Θεραπεία (CBT) συνδυάζονται για να προσφέρουν μια ολοκληρωμένη προσέγγιση στην αντιμετώπιση του άγχους και άλλων ψυχολογικών προβλημάτων. Οι τεχνικές χαλάρωσης περιλαμβάνουν μεθόδους όπως η αναπνοή και η προοδευτική χαλάρωση των μυών, που βοηθούν στην άμεση μείωση του άγχους και της έντασης. Η CBT, από την άλλη πλευρά, επικεντρώνεται στην αλλαγή αρνητικών σκέψεων και συμπεριφορών μέσω τεχνικών ανάλυσης και στρατηγικών παρέμβασης. Ο συνδυασμός αυτών των δύο μεθόδων μπορεί να ενισχύσει την ψυχική ανθεκτικότητα και να προάγει την ευημερία.',
      },
      {
        title: 'Οφέλη των Τεχνικών Χαλάρωσης και CBT',
        paragraph:
          'Η συνδυασμένη χρήση τεχνικών χαλάρωσης και CBT προσφέρει ευεργετικά αποτελέσματα στη διαχείριση του άγχους και στην ψυχική υγεία. Οι τεχνικές χαλάρωσης προσφέρουν άμεση ανακούφιση από το στρες, ενώ η CBT βοηθά στην αλλαγή καταστροφικών σκέψεων και συμπεριφορών. Μαζί, αυτές οι μέθοδοι προάγουν μια πιο ισχυρή ψυχική ανθεκτικότητα και ενδυναμώνουν τα άτομα να αντιμετωπίσουν αποτελεσματικά τις προκλήσεις της ζωής.',
      },
    ],
  },
  {
    id: 6,
    nameId: 'mindfulness',
    imageUrl: mindfulness,
    generalTitle: 'Γενικές Πληροφορίες για τον Διαλογισμό Mindfulness',
    mainTitle: 'MINDFULNESS ΔΙΑΛΟΓΙΣΜΟΣ',
    linkTitle: 'Mindfulness διαλογισμός',
    startingParagraph:
      'Ψυχολογική τεχνική που επικεντρώνεται στην ανάπτυξη της προσεκτικότητας και της επίγνωσης στην καθημερινότητα.',
    sections: [
      {
        title: 'Τι είναι ο Διαλογισμός Mindfulness;',
        paragraph:
          'Ο Διαλογισμός Mindfulness είναι μια τεχνική που ενθαρρύνει τα άτομα να εστιάζουν πλήρως στην παρούσα στιγμή με αποδοχή και χωρίς κριτική. Περιλαμβάνει τη συνειδητή παρατήρηση των σκέψεων, συναισθημάτων και αισθήσεων χωρίς να προσπαθήσουμε να τα αλλάξουμε ή να τα κρίνουμε. Αυτή η πρακτική βοηθά τα άτομα να αναγνωρίσουν και να αποδεχτούν τις εσωτερικές τους εμπειρίες, προάγοντας τη συνειδητότητα και μειώνοντας την επαναλαμβανόμενη αρνητική σκέψη. Ο διαλογισμός Mindfulness είναι συχνά μέρος ενός ευρύτερου προγράμματος που περιλαμβάνει τεχνικές χαλάρωσης και αυτογνωσίας.',
      },
      {
        title: 'Οφέλη του Διαλογισμού Mindfulness',
        paragraph:
          'Η πρακτική του Mindfulness έχει αποδειχθεί ότι συμβάλλει στη μείωση του άγχους, στη βελτίωση της συγκέντρωσης και στην προαγωγή της ψυχικής ηρεμίας. Βοηθά τα άτομα να αναπτύξουν μια βαθύτερη σύνδεση με τις σκέψεις και τα συναισθήματά τους, επιτρέποντας τους να αντιδρούν με μεγαλύτερη συνειδητότητα στις προκλήσεις της ζωής. Επιπλέον, η τακτική πρακτική του Mindfulness μπορεί να ενισχύσει τη συνολική ευημερία, την ικανότητα διαχείρισης του άγχους και τη βελτίωση των σχέσεων με άλλους.',
      },
    ],
  },
  {
    id: 7,
    nameId: 'guided-imagery',
    imageUrl: guidedImagery,
    generalTitle:
      'Γενικές Πληροφορίες για τις Καθοδηγούμενες Εικόνες και Οραματισμούς',
    mainTitle: 'ΚΑΘΟΔΗΓΟΥΜΕΝΕΣ ΕΙΚΟΝΕΣ ΚΑΙ ΟΡΑΜΑΤΙΣΜΟΙ',
    linkTitle: 'Καθοδηγούμενες εικόνες',
    startingParagraph:
      'Ψυχολογική μέθοδος που χρησιμοποιεί την οπτική φαντασία για την αυτογνωσία και την ενίσχυση της θεραπευτικής διαδικασίας.',
    sections: [
      {
        title: 'Τι είναι οι Καθοδηγούμενες Εικόνες και Οραματισμοί;',
        paragraph:
          'Οι Καθοδηγούμενες Εικόνες και Οραματισμοί είναι μια τεχνική που ενθαρρύνει τη χρήση της φαντασίας για την επίτευξη χαλάρωσης και αυτογνωσίας. Μέσω καθοδηγούμενων ασκήσεων, οι συμμετέχοντες καθοδηγούνται σε φανταστικές σκηνές και εικόνες που τους βοηθούν να εξερευνήσουν συναισθηματικές καταστάσεις και να προάγουν τη θεραπευτική πρόοδο. Αυτή η διαδικασία ενισχύει τη σύνδεση με το εσωτερικό μας κόσμο, επιτρέποντας τη μείωση του άγχους και την ανακάλυψη εσωτερικών πηγών δύναμης και γαλήνης.',
      },
      {
        title: 'Οφέλη των Καθοδηγούμενων Εικόνων και Οραματισμών',
        paragraph:
          'Η χρήση καθοδηγούμενων εικόνων και οραματισμών προάγει τη χαλάρωση, βελτιώνει την ψυχική υγεία και βοηθά στην επεξεργασία συναισθημάτων και εμπειριών. Μέσω αυτής της πρακτικής, τα άτομα μπορούν να αναπτύξουν μια πιο βαθιά κατανόηση των εσωτερικών τους διαδικασιών, να ανακουφιστούν από το άγχος και να ενισχύσουν την προσωπική τους ευημερία. Επίσης, μπορεί να είναι χρήσιμη για τη βελτίωση της συγκέντρωσης, της δημιουργικότητας και της αυτογνωσίας.',
      },
    ],
  },
];

export default therapyToolsAnalysis;
