import { StaticImageData } from 'next/image';
import artTherapy from '../../public/images/art-therapy.jpg';
import sleepTherapy from '../../public/images/sleep-therapy.jpg';
import transpersonalCoaching from '../../public/images/transpersonal-coaching.jpg';
import positivePsychology from '../../public/images/positive-psychology.jpg';
import cbt from '../../public/images/cbt.jpg';
import mindfulness from '../../public/images/mindfulness.jpg';
import guidedImagery from '../../public/images/guided-imagery.jpg';
import focusing from '../../public/images/focusing.jpg';

export interface TherapyToolAnalysis {
  id: number;
  nameId: string;
  imageUrl: StaticImageData;
  generalTitle: string;
  mainTitle: string;
  startingParagraph?: string;
  linkTitle: string;
  sections: {
    title: string;
    paragraph: string;
  }[];
}

const therapyToolsAnalysis: TherapyToolAnalysis[] = [
  {
    id: 1,
    imageUrl: artTherapy,
    generalTitle: 'Γενικές Πληροφορίες για την Τέχνη',
    nameId: 'art-therapy',
    mainTitle: 'EXPRESSIVE ARTS THERAPY / ΘΕΡΑΠΕΙΑ ΜΕΣΩ ΤΕΧΝΗΣ',
    startingParagraph:
      'Μέθοδος θεραπείας που χρησιμοποιεί την τέχνη ως μέσο για την επίτευξη εσωτερικής αλλαγής και αυτογνωσίας.',
    linkTitle: 'Expressive Arts Therapy',
    sections: [
      {
        title: 'Τι είναι η Θεραπεία Μέσω Τέχνης;',
        paragraph:
          'Η θεραπεία μέσω τέχνης είναι μια μορφή θεραπείας που αξιοποιεί τη δημιουργική διαδικασία της καλλιτεχνικής έκφρασης για τη βελτίωση της ψυχικής, συναισθηματικής και σωματικής ευεξίας ενός ατόμου. Συνδυάζει παραδοσιακές ψυχοθεραπευτικές τεχνικές με τη δημιουργική διαδικασία για να βοηθήσει τους πελάτες να εξερευνήσουν τα συναισθήματά τους, σε υποσυνείδητο επίπεδο, και να ενισχύσουν την αυτογνωσία τους.',
      },
      {
        title: 'Οφέλη της Θεραπείας Μέσω Τέχνης',
        paragraph:
          'Η θεραπεία μέσω τέχνης μπορεί να είναι ευεργετική για άτομα όλων των ηλικιών και κοινωνικών προελεύσεων. Δεν απαιτείται καμία καλλιτεχνική δεξιότητα ή ταλέντο για να συμμετάσχει κανείς. Μπορεί να χρησιμοποιηθεί για την αντιμετώπιση μιας ευρείας γκάμας ζητημάτων, όπως π.χ. το άγχος, το τραύμα και τα προβλήματα σχέσεων.',
      },
    ],
  },
  {
    id: 2,
    nameId: 'hypnotherapy',
    imageUrl: sleepTherapy,
    generalTitle: 'Γενικές Πληροφορίες για την Υπνοθεραπεία',
    mainTitle: 'ΥΠΝΟΘΕΡΑΠΕΙΑ',
    linkTitle: 'Υπνοθεραπεία',
    startingParagraph:
      'Θεραπευτική τεχνική που χρησιμοποιεί την ύπνωση για την αντιμετώπιση προβλημάτων ή την επίτευξη ενός στόχου.',
    sections: [
      {
        title: 'Τι είναι η Υπνοθεραπεία;',
        paragraph:
          'Η Υπνοθεραπεία είναι μια ψυχοθεραπευτική τεχνική που χρησιμοποιεί τη χαλάρωση και τις καθοδηγούμενες προτάσεις για να επιφέρει αλλαγές στις σκέψεις και τη συμπεριφορά ενός ατόμου. Μέσω της ύπνωσης, ο θεραπευτής καθοδηγεί τον πελάτη σε μια κατάσταση βαθιάς χαλάρωσης και συγκέντρωσης, επιτρέποντας την πρόσβαση στο υποσυνείδητο. Αυτή η διαδικασία μπορεί να αποκαλύψει υποκείμενα συναισθηματικά ζητήματα και να βοηθήσει στην επίλυση προβλημάτων ή τραυμάτων που δεν είναι εύκολα προσεγγίσιμα με άλλες θεραπευτικές μεθόδους.',
      },
      {
        title: 'Οφέλη της Υπνοθεραπείας',
        paragraph:
          'Η Υπνοθεραπεία μπορεί να προσφέρει πολλαπλά οφέλη για την ψυχική και σωματική ευεξία. Βοηθά στην αποτελεσματική διαχείριση του άγχους, προσφέροντας μια μέθοδο για τη χαλάρωση και την ανακούφιση από ψυχικές εντάσεις. Επίσης, μπορεί να χρησιμοποιηθεί για μία σειρά άλλων ζητημάτων, π.χ. την μείωση του στρες την αύξηση της αυτοεκτίμησης και της αυτοπεποίθησης, την απώλεια βάρους και την διακοπή καπνίσματος.',
      },
    ],
  },
  {
    id: 3,
    nameId: 'transpersonal-coaching',
    imageUrl: transpersonalCoaching,
    generalTitle: 'Γενικές Πληροφορίες για το Υπερπροσωπικό Coaching',
    mainTitle: 'TRANSPERSONAL COACHING/ΥΠΕΡΠΡΟΣΩΠΙΚΟ COACHING',
    linkTitle: 'Transpersonal Coaching',
    startingParagraph:
      'Θεραπευτική μέθοδος coaching που επικεντρώνεται στην ανάπτυξη της αυτογνωσίας και της αντιμετώπισης προβλημάτων.',
    sections: [
      {
        title: 'Τι είναι το Υπερπροσωπικό Coaching;',
        paragraph:
          'Το Υπερπροσωπικό Coaching συνδυάζει τις παραδοσιακές τεχνικές coaching με πνευματικές και φιλοσοφικές προσεγγίσεις, για να ενισχύσει την προσωπική ανάπτυξη και την αυτογνωσία. Αυτή η μέθοδος ενθαρρύνει τα άτομα να εξερευνήσουν βαθύτερες πτυχές της προσωπικότητάς τους και να αναγνωρίσουν τις πνευματικές τους αξίες και στόχους. Μέσω της διαδικασίας του coaching, οι πελάτες μαθαίνουν να συνδυάζουν τις προσωπικές τους επιδιώξεις με μια μεγαλύτερη αίσθηση σκοπού και νόημα στη ζωή τους.',
      },
      {
        title: 'Οφέλη του Υπερπροσωπικού Coaching',
        paragraph:
          'Το Υπερπροσωπικό Coaching μπορεί να προσφέρει μια ποικιλία οφελών, όπως η αύξηση της αυτογνωσίας, η πνευματική ανάπτυξη και η επίτευξη προσωπικών και επαγγελματικών στόχων. Βοηθά τους ανθρώπους να αποκτήσουν μια σαφέστερη κατανόηση των εσωτερικών τους κινήτρων και να προχωρήσουν σε αλλαγές που ενισχύουν την προσωπική τους ευημερία.',
      },
    ],
  },
  {
    id: 4,
    nameId: 'positive-psychology',
    imageUrl: positivePsychology,
    generalTitle: 'Γενικές Πληροφορίες για τη Θετική Ψυχολογία',
    mainTitle: 'ΘΕΤΙΚΗ ΨΥΧΟΛΟΓΙΑ',
    linkTitle: 'Θετική Ψυχολογία',
    startingParagraph:
      'Ψυχολογική προσέγγιση που επικεντρώνεται στην ανάπτυξη των θετικών ψυχικών διαδικασιών και της ευεξίας.',
    sections: [
      {
        title: 'Τι είναι η Θετική Ψυχολογία;',
        paragraph:
          'Η Θετική Ψυχολογία είναι ένας τομέας της ψυχολογίας που επικεντρώνεται στην ενίσχυση των θετικών συναισθημάτων, της ευημερίας και των επιτευγμάτων. Σε αντίθεση με άλλες ψυχολογικές προσεγγίσεις, η Θετική Ψυχολογία εξετάζει τρόπους για την ενίσχυση της θετικής εμπειρίας και της προσωπικής ανάπτυξης. Στοχεύει στην καλλιέργεια της ευτυχίας, της ελπίδας, και της ευγνωμοσύνης, προάγοντας την συνολική ποιότητα ζωής.',
      },
      {
        title: 'Οφέλη της Θετικής Ψυχολογίας',
        paragraph:
          'Η Θετική Ψυχολογία συμβάλλει στη βελτίωση της ψυχικής ευημερίας των ατόμων. Μέσω της ανάπτυξης θετικών σκέψεων και συναισθημάτων, προάγει την ικανότητα των ανθρώπων να αντιμετωπίζουν προκλήσεις και να επιτυγχάνουν προσωπικούς στόχους. Ενισχύει τη συναισθηματική ανθεκτικότητα, βελτιώνει τις διαπροσωπικές σχέσεις και συμβάλλει στην αίσθηση της ευημερίας και της πληρότητας στη ζωή.',
      },
    ],
  },
  {
    id: 5,
    nameId: 'relaxation-techniques-cbt',
    imageUrl: cbt,
    generalTitle: 'Γενικές Πληροφορίες για τις Τεχνικές Χαλάρωσης και CBT',
    mainTitle: 'ΤΕΧΝΙΚΕΣ ΧΑΛΑΡΩΣΗΣ + CBT',
    linkTitle: 'Τεχνικές Χαλάρωσης + CBT',
    startingParagraph:
      'Συνδυασμός τεχνικών χαλάρωσης και Συμπεριφορικής Θεραπείας για την αντιμετώπιση του άγχους και του στρες.',
    sections: [
      {
        title: 'Τι είναι οι Τεχνικές Χαλάρωσης και CBT;',
        paragraph:
          'Οι Τεχνικές Χαλάρωσης και η Γνωσιακή Συμπεριφορική Θεραπεία (CBT) συνδυάζονται για να προσφέρουν μια ολοκληρωμένη προσέγγιση στην αντιμετώπιση του άγχους και άλλων καταστάσεων. Οι τεχνικές χαλάρωσης περιλαμβάνουν μεθόδους όπως η αναπνοή και η προοδευτική χαλάρωση των μυών, που βοηθούν στην άμεση μείωση του άγχους και της έντασης. Η CBT, από την άλλη πλευρά, επικεντρώνεται στην αλλαγή των αρνητικών σκέψεων και συμπεριφορών μέσω τεχνικών ανάλυσης και στρατηγικών παρέμβασης.',
      },
      {
        title: 'Οφέλη των Τεχνικών Χαλάρωσης και CBT',
        paragraph:
          'Η συνδυασμένη χρήση τεχνικών χαλάρωσης και CBT προσφέρει ευεργετικά αποτελέσματα στη διαχείριση του άγχους και στη συνολικότερη ψυχική υγεία. Οι τεχνικές χαλάρωσης προσφέρουν άμεση ανακούφιση από το στρες, ενώ η CBT βοηθά στην αλλαγή των αρνητικών σκέψεων και συμπεριφορών. Αυτές οι δύο μέθοδοι προάγουν μια πιο ισχυρή ψυχική ανθεκτικότητα και ενδυναμώνουν τα άτομα ώστε να αντιμετωπίσουν αποτελεσματικά τις προκλήσεις της ζωής.',
      },
    ],
  },
  {
    id: 6,
    nameId: 'mindfulness',
    imageUrl: mindfulness,
    generalTitle: 'Γενικές Πληροφορίες για τον Διαλογισμό Mindfulness',
    mainTitle: 'MINDFULNESS ΔΙΑΛΟΓΙΣΜΟΣ',
    linkTitle: 'Mindfulness Διαλογισμός',
    startingParagraph:
      'Τεχνική που επικεντρώνεται στην ανάπτυξη της παρατήρησης και της ενσυνειδητότητας στην καθημερινότητα.',
    sections: [
      {
        title: 'Τι είναι ο Διαλογισμός Mindfulness;',
        paragraph:
          'Ο Mindfulness Διαλογισμός είναι μια τεχνική που ενθαρρύνει τα άτομα να εστιάζουν πλήρως στην παρούσα στιγμή, με αποδοχή, χωρίς κριτική. Περιλαμβάνει τη συνειδητή παρατήρηση των σκέψεων, συναισθημάτων και αισθήσεων, χωρίς να προσπαθήσουμε να τα αλλάξουμε ή να τα κρίνουμε. Αυτή η πρακτική βοηθά τα άτομα να αναγνωρίσουν και να αποδεχτούν τις εσωτερικές τους εμπειρίες, προάγοντας την ενσυνειδητότητα και μειώνοντας την επαναλαμβανόμενη αρνητική σκέψη. Ο Mindfulness Διαλογισμός είναι συχνά μέρος ενός ευρύτερου προγράμματος που περιλαμβάνει τεχνικές χαλάρωσης και αυτογνωσίας.',
      },
      {
        title: 'Οφέλη του Διαλογισμού Mindfulness',
        paragraph:
          'Η πρακτική του Mindfulness Διαλογισμού έχει αποδειχθεί ότι συμβάλλει στη μείωση του άγχους, στη βελτίωση της συγκέντρωσης και στην ενίσχυση της ψυχικής ηρεμίας. Βοηθά τα άτομα να αναπτύξουν μια βαθύτερη σύνδεση με τις σκέψεις και τα συναισθήματά τους, επιτρέποντας τους να αντιδρούν με μεγαλύτερη συνειδητότητα στις καθημερινές προκλήσεις. Επιπλέον, η τακτική εφαρμογή του Mindfulness μπορεί να ενισχύσει τη συνολική ευημερία, την ικανότητα διαχείρισης του άγχους και τη βελτίωση των σχέσεων με τους άλλους ανθρώπους.',
      },
    ],
  },
  {
    id: 7,
    nameId: 'guided-imagery',
    imageUrl: guidedImagery,
    generalTitle:
      'Γενικές Πληροφορίες για τις Καθοδηγούμενες Εικόνες και Οραματισμούς',
    mainTitle: 'ΚΑΘΟΔΗΓΟΥΜΕΝΕΣ ΕΙΚΟΝΕΣ ΚΑΙ ΟΡΑΜΑΤΙΣΜΟΙ',
    linkTitle: 'Καθοδηγούμενες Εικόνες & Οραματισμοί',
    startingParagraph:
      'Μέθοδος που χρησιμοποιεί την οπτική φαντασία για την αυτογνωσία και την ενίσχυση της θεραπευτικής διαδικασίας.',
    sections: [
      {
        title: 'Τι είναι οι Καθοδηγούμενες Εικόνες και Οραματισμοί;',
        paragraph:
          'Οι Καθοδηγούμενες Εικόνες και Οραματισμοί είναι μια τεχνική που ενθαρρύνει τη χρήση της φαντασίας για την επίτευξη χαλάρωσης και αυτογνωσίας. Μέσω καθοδηγούμενων ασκήσεων, οι συμμετέχοντες καθοδηγούνται σε φανταστικές σκηνές και εικόνες που τους βοηθούν να εξερευνήσουν συναισθηματικές καταστάσεις και να προάγουν τη θεραπευτική πρόοδο. Αυτή η διαδικασία ενισχύει τη σύνδεση με τον εσωτερικό μας κόσμο, οδηγώντας στη μείωση του άγχους και την ανακάλυψη εσωτερικών πηγών δύναμης και γαλήνης.',
      },
      {
        title: 'Οφέλη των Καθοδηγούμενων Εικόνων και Οραματισμών',
        paragraph:
          'Η χρήση καθοδηγούμενων εικόνων και οραματισμών προάγει τη χαλάρωση, βελτιώνει την ψυχική υγεία και βοηθά στην επεξεργασία συναισθημάτων και εμπειριών. Μέσω αυτής της πρακτικής, τα άτομα μπορούν να αναπτύξουν μια πιο βαθιά κατανόηση των εσωτερικών τους διαδικασιών, να ανακουφιστούν από το άγχος και να βρουν δημιουργικούς τρόπους για την επίτευξη στόχων. Επίσης, μπορεί να είναι χρήσιμη για τη βελτίωση της συγκέντρωσης, της φαντασίας, της δημιουργικότητας και της αυτογνωσίας.',
      },
    ],
  },
  {
    id: 8,
    nameId: 'focusing',
    imageUrl: focusing,
    generalTitle: 'Γενικές Πληροφορίες για τo Focusing',
    mainTitle: 'FOCUSING',
    linkTitle: 'Focusing',
    startingParagraph:
      'Mέθοδος εσωτερικής εστίασης που βοηθά τα άτομα να αναγνωρίζουν και να κατανοούν βαθύτερα τα συναισθήματά τους μέσω της σύνδεσης με τις σωματικές τους αισθήσεις.',
    sections: [
      {
        title: 'Τι είναι το Focusing;',
        paragraph:
          'To Focusing είναι μια σωματικά προσανατολισμένη μέθοδος αυτεπίγνωσης, αλλαγής και ανάπτυξης. Περιλαμβάνει το να αισθανόμαστε στο σώμα μας και να λαμβάνουμε τα μηνύματα που έχει να μας δώσει για τις καταστάσεις που ζούμε. Είναι μια διαδικασία που μας βοηθά να κατανοούμε βαθύτερα τον εαυτό μας και τα συναισθήματα μας, να επιλύουμε δημιουργικά τα προβλήματα που αντιμετωπίζουμε, και να κάνουμε θετικές αλλαγές στη ζωή μας.',
      },
      {
        title: 'Οφέλη του Focusing',
        paragraph:
          'Το Focusing προσφέρει πολλά οφέλη, όπως αυξημένη συναισθηματική επίγνωση, μείωση του άγχους και βελτιωμένη νοητική διαύγεια. Μέσα από την εστίαση στις εσωτερικές σωματικές αισθήσεις, τα άτομα μπορούν να κατανοήσουν και να επεξεργαστούν καλύτερα τα συναισθήματά τους, οδηγώντας σε μεγαλύτερη αυτογνωσία και προσωπική ανάπτυξη. Αυτή η πρακτική προάγει επίσης τη χαλάρωση, συμβάλλοντας στη μείωση του άγχους και στη βελτίωση της συνολικής ευεξίας.',
      },
    ],
  },
];

export default therapyToolsAnalysis;
